'''
Operations
There are lots of operations with pandas that will be really useful'''

In [5]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8],'col2':[444,555,666,444,225,444,5558,555],'col3':['abc','def','ghi','xyz','def','ghi','xyz','jjj']})
# it will show only 5 values of a dataframe
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   225  def

In [6]:
# for find unique values
df['col2'].unique()

array([ 444,  555,  666,  225, 5558])

In [7]:
# for find length of unique value
# remember len function start from 1 to n
len(df['col2'].unique())

5

In [8]:
# if you want to count number of unique value via another way then we can do this
df['col2'].nunique()

5

Selecting Data

In [9]:
'''for count the similar value in any column'''
df['col2'].value_counts()

444     3
555     2
225     1
666     1
5558    1
Name: col2, dtype: int64

In [14]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   225  def
5     6   444  ghi
6     7  5558  xyz
7     8   555  jjj

In [15]:
# here we can select the data according to our choice
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz
5     6   444  ghi

Applying Function on Pandas

In [16]:
def mul_2(x):
    return x*2

In [19]:
df.apply(mul_2) # for apply complete function on DataFrame

0      888
1     1110
2     1332
3      888
4      450
5      888
6    11116
7     1110
Name: col2, dtype: int64

In [20]:
df['col2'].apply(mul_2) # for apply function on particular column

0      888
1     1110
2     1332
3      888
4      450
5      888
6    11116
7     1110
Name: col2, dtype: int64

In [21]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
4     5   225  def
5     6   444  ghi
6     7  5558  xyz
7     8   555  jjj

In [29]:
df.loc[1] # selecting row from Dataframe

col1      2
col2    555
col3    def
Name: 1, dtype: object

In [32]:
# example of lambda with apply function
df['col2'].apply(lambda x: x*2 )

0      888
1     1110
2     1332
3      888
4      450
5      888
6    11116
7     1110
Name: col2, dtype: int64

In [34]:
# for removing columns
df.drop('col1',axis=1) # for permanent del we use inplace=True

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz
4   225  def
5   444  ghi
6  5558  xyz
7   555  jjj

In [37]:
# for check the column name
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [39]:
#  for check the index 
df.index

RangeIndex(start=0, stop=8, step=1)

In [40]:
# fro sort the value
df.sort_values(by = 'col2')

   col1  col2 col3
4     5   225  def
0     1   444  abc
3     4   444  xyz
5     6   444  ghi
1     2   555  def
7     8   555  jjj
2     3   666  ghi
6     7  5558  xyz

In [41]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False

### Pivot Table 
A Pivot Table is used to summarise, sort, reorganise, group, count, total or average data stored in a table. It allows us to transform columns into rows and rows into columns. It allows grouping by any field (column), and using advanced calculations on them

In [42]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [44]:
df.pivot_table(values = 'D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN